In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "değisken1":[10,23,33,22,11,99],
                  "değisken2":[100,253,333,262,111,969]},
                 columns = ["gruplar","değisken1","değisken2"])
df

  gruplar  değisken1  değisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [3]:
df["değisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: değisken1, dtype: int64

In [7]:
df_a = df.iloc[:,1:3]

In [9]:
df_a.transform(lambda x : x-x.mean())

   değisken1  değisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [11]:
df_a.transform(lambda x : (x-x.mean()) / x.std())

   değisken1  değisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [12]:
#apply

In [14]:
df = pd.DataFrame({
                  "değisken1":[10,23,33,22,11,99],
                  "değisken2":[100,253,333,262,111,969]},
                 columns = ["değisken1","değisken2"])
df

   değisken1  değisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [19]:
df.apply(np.sum)

değisken1     198
değisken2    2028
dtype: int64

In [20]:
df.apply(np.mean)

değisken1     33.0
değisken2    338.0
dtype: float64